import React from "react";

const PaymentMethods = () => {
  return (
    <div style={{ padding: "20px", fontFamily: "Arial, sans-serif" }}>
      <h1>Τρόποι Πληρωμής</h1>
      <p>Πως μπορώ να κάνω πληρωμές για τις online αγορές μου;</p>
      <p>
        Κάνοντας παραγγελία online από το{" "}
        <a href="http://www.castine.gr">www.castine.gr</a> μπορείτε να επιλέξετε
        πληρωμή με τους παρακάτω τρόπους.
      </p>

      <h2>Πληρωμή με Αντικαταβολή</h2>
      <ul>
        <li>
          Η υπηρεσία πληρωμής με την μέθοδο αντικαταβολής έχει έξτρα επιβάρυνση
          2€.
        </li>
        <li>
          Η παραγγελία σας εκτελείται άμεσα χωρίς καθυστερήσεις, η παραλαβή της
          πραγματοποιείται στο χώρο σας από την Εταιρία ACS Courier και η
          εξόφληση πραγματοποιείται επιτόπου με την παράδοση.
        </li>
        <li>
          Η υπηρεσία πληρωμής με την μέθοδο αντικαταβολής <strong>δεν</strong>{" "}
          είναι δυνατή για αποστολές σε Κύπρο.
        </li>
      </ul>

      <h2>Πληρωμή με Πιστωτική ή Χρεωστική Κάρτα</h2>
      <p>
        Στο ηλεκτρονικό μας κατάστημα έχετε τη δυνατότητα πληρωμής με όλες τις
        αποδεκτές κάρτες πιστωτικές, χρεωστικές και προπληρωμένες (Visa,
        MasterCard, Maestro, Electron).
      </p>
      <p>
        Για να διασφαλιστεί η απόλυτη ασφάλεια των ηλεκτρονικών συναλλαγών μέσω
        πιστωτικών και χρεωστικών καρτών, αυτές γίνονται μέσα από το σύστημα
        ασφαλείας της Τράπεζας Πειραιώς (ePOS Paycenter), το οποίο βασίζεται στη
        διεθνή εταιρεία προστασίας συναλλαγών (GLOBE SSL).
      </p>
      <p>
        Η διαδικασία πληρωμής με πιστωτική ή χρεωστική κάρτα είναι πολύ απλή:
      </p>
      <ul>
        <li>
          Κατά την καταχώρηση της παραγγελίας σας, επιλέγετε τον τρόπο πληρωμής
          "Πιστωτική ή Χρεωστική Κάρτα".
        </li>
        <li>
          Μόλις ολοκληρώσετε την καταχώρηση, μεταφέρεστε αυτόματα στο ασφαλές
          περιβάλλον της Τράπεζας Πειραιώς (ePOS Paycenter).
        </li>
        <li>Συμπληρώνετε όλα τα απαραίτητα πεδία και επιλέγετε "Πληρωμή".</li>
      </ul>
      <p>
        Ολοκληρώνοντας την πληρωμή, θα λάβετε email με όλα τα στοιχεία της
        παραγγελίας σας.
      </p>

      <h2>Πληρωμή με Τραπεζική Μεταφορά (Πειραιώς / Piraeus Bank)</h2>
      <p>
        Σε περίπτωση διαφορετικών τραπεζών (εκτός της τράπεζας Πειραιώς /
        Piraeus Bank) στην Ελλάδα ή στο εξωτερικό, ενδέχεται να υπάρχουν
        τραπεζικές χρεώσεις, οι οποίες καλύπτονται πάντα από εσάς.
      </p>
    </div>
  );
};

export default PaymentMethods;
