import React from "react";

const ReturnPolicy = () => {
  return (
    <div style={{ padding: "20px", fontFamily: "Arial, sans-serif" }}>
      <h1>Πολιτική Επιστροφών</h1>

      <h2>Επιστροφές προϊόντων πανελλαδικά</h2>
      <p>
        Επιστροφές γίνονται δεκτές κατόπιν συνεννόησης στο{" "}
        <a href="mailto:info@castine.gr">info@castine.gr</a> ή στη φόρμα
        επικοινωνίας και μόνο στην περίπτωση που τα προϊόντα είναι
        αχρησιμοποίητα και δεν έχει αλλοιωθεί η αρχική τους συσκευασία.
      </p>
      <p>
        Στην περίπτωση χρησιμοποίησης του προϊόντος ή αλλοίωσης της αρχικής
        συσκευασίας, καμία επιστροφή δεν γίνεται δεκτή.
      </p>
      <p>
        Οι επιστροφές γίνονται δεκτές για (14) δεκατέσσερις ημέρες από την
        παράδοση των προϊόντων εφόσον πληρούν τις παραπάνω προδιαγραφές, χωρίς
        καμία επιβάρυνση εφόσον υπάρχει ευθύνη της εταιρείας. Σε διαφορετική
        περίπτωση τα έξοδα επιβαρύνουν τον πελάτη. Σε κάθε περίπτωση, η
        επιστροφή πραγματοποιείται υπ’ ευθύνη του Πελάτη.
      </p>
      <p>
        Η CASTINE δεν είναι υπεύθυνη για απώλειες ή λάθος διανομές επιστροφών.
        Κανένα ποσό δεν μπορεί να επιστραφεί για το χαμένο ή μη ληφθέν προϊόν.
      </p>
      <p>
        Οι επιστροφές των χρημάτων σας γίνονται εντός (10) δέκα ημερών από την
        επιστροφή και παραλαβή των προϊόντων από την εταιρία μας.
      </p>
      <p>
        Στην περίπτωση λάθους της εταιρίας μας, σας επιστρέφουμε πλήρως την αξία
        της παραγγελίας και το κόστος αποστολής.
      </p>
      <p>
        Στην περίπτωση που κάποιο προϊόν έχει αλλοιωθεί/σπάσει μέσα στη
        συσκευασία, κατά τη διάρκεια της αποστολής, γίνεται αντικατάσταση, μόνο
        και εφόσον ενημερωθούμε την ημέρα της παραλαβής του στο{" "}
        <a href="mailto:info@castine.gr">info@castine.gr</a> ή στη φόρμα
        επικοινωνίας. Πέραν αυτού του χρονικού διαστήματος αντικατάσταση δεν
        είναι δυνατή.
      </p>
      <p>
        Σε κάθε περίπτωση είναι απαραίτητη η προσκόμιση της απόδειξης λιανικής.
      </p>
      <p>
        Παρακαλώ πολύ λάβετε υπόψη ότι δεν δίνεται η δυνατότητα επιστροφής
        χρημάτων για προϊόντα τα οποία αγοράστηκαν με έκπτωση και ότι αυτά τα
        προϊόντα δεν μπορούν να ανταλλαχθούν με άλλο προϊόν, πλην των
        ελαττωματικών.
      </p>
      <p>
        Εάν ο τρόπος πληρωμής της αρχικής αγοράς ήταν η Αντικαταβολή, τότε θα
        πρέπει να μας στείλετε έναν τραπεζικό λογαριασμό στο{" "}
        <a href="mailto:info@castine.gr">info@castine.gr</a> ώστε να προβούμε
        στην επιστροφή των χρημάτων σας. Σε περίπτωση που ο τρόπος αγοράς ήταν
        μέσω πιστωτικής/χρεωστικής κάρτας, η επιστροφή χρημάτων θα πιστωθεί στον
        αρχικό τρόπο πληρωμής.
      </p>
      <p>
        Εάν η αρχική μέθοδος αγοράς είναι η Πληρωμή μέσω τραπεζικής μεταφοράς,
        παρακαλούμε σημειώστε ότι η επιστροφή χρημάτων θα πιστωθεί στον
        τραπεζικό λογαριασμό που ορίζει ο Πελάτης. Σε περίπτωση διαφορετικών
        τραπεζών (εκτός της τράπεζας Πειραιώς / Piraeus bank) στην Ελλάδα ή στο
        εξωτερικό, ενδέχεται να υπάρχουν τραπεζικές χρεώσεις, οι οποίες
        καλύπτονται πάντα από εσάς και αυτές οι χρεώσεις θα αφαιρούνται από τη
        συνολική επιστροφή χρημάτων.
      </p>

      <h2>Διαδικασία επιστροφής προϊόντων</h2>
      <h3>Αποστολή προς την εταιρία μας</h3>
      <p>
        Κατόπιν επικοινωνίας, συσκευάζετε (όσο το δυνατόν καλύτερα για να μην
        έχει φθορά κατά την επιστροφή) και αποστέλετε το προϊόν με τη
        συνεργαζόμενη ταχυμεταφορική εταιρία, έχοντας συμπεριλάβει την απόδειξη
        λιανικής. Σε περίπτωση που το προϊόν δεν πληρεί τις προϋποθέσεις
        επιστροφής, η επιστροφή δεν θα γίνεται δεκτή και θα επιστρέφεται στον
        πελάτη, με τα έξοδα μεταφοράς να επιβαρύνουν τον ίδιο.
      </p>

      <h2>Ακύρωση παραγγελίας</h2>
      <p>
        Ακύρωση της παραγγελίας επιτρέπεται να γίνει, με την προϋπόθεση ότι τα
        προϊόντα δεν έχουν αποσταλεί από την εταιρία.
      </p>

      <p>
        Με την παραγγελία στo <a href="http://www.castine.gr">www.castine.gr</a>
        ο Πελάτης αποδέχεται όλους τους όρους αυτής της Πολιτικής Επιστροφών.
      </p>
    </div>
  );
};

export default ReturnPolicy;
