import React from 'react';
import '../assets/ReturnPolicy.css';

const ReturnPolicy = () => {
  return (
    <div className="return-policy-container">
      <h2 className="policy-title">Πολιτική Επιστροφών</h2>
      <h3 className="section-title">ΕΠΙΣΤΡΟΦΕΣ - ΑΛΛΑΓΕΣ ΠΡΟΪΟΝΤΩΝ</h3>
      <p>
        ➤ Οι επιστροφές προϊόντων μπορούν να πραγματοποιηθούν εφόσον τηρούνται οι εξής προϋποθέσεις:
      </p>
      <ul>
        <li> Έχετε το δικαίωμα να επιστρέψετε τα προϊόντα που αγοράσατε εντός προθεσμίας 14 ημερών από την ημερομηνία που τα παραλάβατε.</li>
        <li> Η επιστροφή / αντικατάσταση των προϊόντων πραγματοποιείται με τον ίδιο τρόπο που έγινε και η αγορά αυτών (σε κατάστημα, παραλαβή με τη μεταφορική).</li>
        <li> Τα προϊόντα πρέπει να είναι στην ίδια κατάσταση στην οποία τα παραλάβατε, χωρίς δηλαδή να έχουν αποσφραγισθεί ή να έχει παραβιασθεί η συσκευασία τους, και να συνοδεύονται από όλα τα σχετικά αποδεικτικά έγγραφα της συναλλαγής (Απόδειξη Λιανικής Πώλησης ή Τιμολόγιο και Δελτίο Αποστολής, έγγραφο / σημείωμα που να αναφέρει το λόγο της επιστροφής).</li>
        <li> Στην περίπτωση επιστροφής / αντικατάστασης λόγω ελαττωματικού προϊόντος ή για άλλο λόγο που μπορεί να ευθύνεται η εταιρεία, το κόστος επιστροφής το καλύπτει η 'La Vie En Rose'.</li>
        <li> Σε περίπτωση επιστροφής / αντικατάστασης προϊόντος που οφείλεται σε οποιοδήποτε άλλο λόγο, τα έξοδα αποστολής βαρύνουν τον πελάτη.</li>
        <li> Σε περίπτωση που η επιστροφή οφείλεται σε υπαιτιότητα της 'Castine Oud', επικοινωνήστε πρώτα με το Τμήμα Εξυπηρέτησης Πελατών στο +30 216 900 1313 ή στο info@lavieenrose.com.gr, ώστε οι εξειδικευμένοι σύμβουλοί μας να σας καθοδηγήσουν αναλόγως.</li>
      </ul>
      <h3 className="section-title">Διαδικασία επιστροφής προϊόντων</h3>
      <p>
        ➤ Η διαδικασία που ακολουθείτε ώστε να επιστρέψετε κάποιο προϊόν είναι η εξής:
      </p>
      <ul>
        <li>Τοποθετείτε το προϊόν στην αρχική του συσκευασία και εσωκλείετε όλα τα σχετικά νομιμοποιητικά έγγραφα που αποδεικνύουν την αρχική συναλλαγή (Απόδειξη Λιανικής Πώλησης ή Τιμολόγιο, Δελτίο Αποστολής, καθώς και ένα έγγραφο (δικό σας σημείωμα), που να αναφέρει το λόγο της επιστροφής).</li>
        {/* <li> Καλείτε το τμήμα εξυπηρέτησης πελατών στο +30 216 900 1313, ώστε οι εξειδικευμένοι σύμβουλοί μας να σας καθοδηγήσουν αναλόγως.</li> */}
        <li>Σε περίπτωση που η παραλαβή έγινε με μεταφορική, οι επιστροφές των προϊόντων πραγματοποιούνται, αποκλειστικά, με τη συνεργαζόμενη εταιρεία Ταχυμεταφορών.</li>
      </ul>
      {/* <p>Η διεύθυνση στην οποία πρέπει να σταλούν τα προϊόντα προς επιστροφή είναι: 'La Vie en Rose' Αγίου Ιωάννου 75Α, Αγία Παρασκευή 15342</p> */}
      <h3 className="section-title">Επιστροφές Προϊόντων με BOX NOW</h3>
      <p>
        ➤ Αν έχεις παραλάβει τα προϊόντα σου μέσω BOX NOW και θες να κάνεις επιστροφή η διαδικασία είναι απλή : Γράψε τον αριθμό δέματος (10ψήφιος αριθμός) ή κόλλησε το αρχικό voucher που έχεις λάβει πάνω στο δέμα, πήγαινε στη θυρίδα που σε εξυπηρετεί, πληκτρολόγησε τον δεκαψήφιο αριθμό και πάτα οκ. Τοποθέτησε το δέμα στη θυρίδα και κλείσε την πόρτα. Μόλις ολοκλήρωσες την επιστροφή!
      </p>
      <h3 className="section-title">Επιστροφή χρημάτων</h3>
      <p>
        ➤ Σε περίπτωση που επιθυμείτε επιστροφή των χρημάτων σας και όχι αντικατάσταση, καθώς επίσης και σε περίπτωση αλλαγής προϊόντος με άλλο μικρότερης αξίας, εφόσον πληρούνται όλες οι προϋποθέσεις, η επιστροφή των χρημάτων πραγματοποιείται με τον ίδιο τρόπο που επιλέξατε να εξοφλήσετε την παραγγελία σας (τραπεζική κατάθεση⭒, paypal, κάρτα). Το διάστημα που απαιτείται για την ολοκλήρωση της διαδικασίας επιστροφής των χρημάτων σας είναι, περίπου, 15 εργάσιμες ημέρες από την ημέρα που θα παραλάβουμε το προϊόν.
      </p>
      <p className="additional-note">⭒Σε περίπτωση αντικαταβολής, η επιστροφή των χρημάτων σας θα πραγματοποιηθεί με τραπεζική κατάθεση.</p>
      <p> Σε περίπτωση που η επιστροφή δεν γίνει μέσα στο χρονικό διάστημα των 14 ημερολογιακών ημερών από την ημέρα παραλαβής τους, ή δεν πληρούνται κάποιες από τις προϋποθέσεις επιστροφής, η 'La Vie en Rose', έχει το δικαίωμα να μη δεχτεί τα προϊόντα και να μην προχωρήσει σε αντικατάστασή τους.</p>
      <h3 className="section-title">Για επιστροφές από το εξωτερικό</h3>
      <p>
        ➤ Παρακαλούμε απευθυνθείτε στην εξυπηρέτηση πελατών στο +30 216 900 1313, να σας κατευθύνουμε αναλόγως.
      </p>
      <p className="thank-you-note">❁Σας ευχαριστούμε πολύ για τη συνεργασία και την εμπιστοσύνη!❁</p>
      <p className="signature">Castine Oud</p>
    </div>
  );
}

export default ReturnPolicy;
