import React from "react";

const ShippingInfo = () => {
  return (
    <div style={{ padding: "20px", fontFamily: "Arial, sans-serif" }}>
      <h1>Αποστολές Πανελλαδικά</h1>
      <p>
        Οι αποστολές των παραγγελιών πραγματοποιούνται μέσω της ACS Courier.
        Κατά την καταχώρηση της παραγγελίας σας, εισάγετε τη διεύθυνση στην
        οποία επιθυμείτε να αποσταλεί η παραγγελία όσο πιο λεπτομερώς γίνεται με
        σημείωση και το όνομα στο κουδούνι.
      </p>
      <p>
        Δωρεάν αποστολή σε ολόκληρη την Ελλάδα για παραγγελίες άνω των 45,00€.
        Για παραγγελίες κάτω των 45,00€ ο αγοραστής επιβαρύνεται με 4€
        μεταφορικά έξοδα για αποστολή παραγγελίας έως 2 κιλά και 1€ για κάθε
        επιπλέον κιλό με ACS courier. Περιπτώσεις ελαφρών δεμάτων με μεγάλο
        όγκο, τότε η χρέωση γίνεται με βάση το ογκομετρικό βάρος.
      </p>

      <h2>Χρόνος Παράδοσης</h2>
      <h3>ACS Courier</h3>
      <ul>
        <li>
          Οι παραγγελίες παραδίδονται με την ACS courier σε 1-4 εργάσιμες
          ημέρες.*
        </li>
        <li>
          Οι παραγγελίες σε δυσπρόσιτες περιοχές παραδίδονται από 1-5 ημέρες.
        </li>
        <li>
          Μπορείτε ανά πάσα στιγμή να δείτε την εξέλιξη της παραγγελίας σας μέσα
          από τις πληροφορίες του Λογαριασμού σας, επιλέγοντας την ενότητα "Οι
          Παραγγελίες μου".
        </li>
        <li>
          Η συγκεκριμενοποίηση της ώρας παράδοσης της εκάστοτε παραγγελίας
          έγκειται στη διακριτική ευχέρεια της εταιρείας ACS Courier της
          περιοχής που σας εξυπηρετεί και δεν μπορούμε να εγγυηθούμε την τήρηση
          των ωραρίων.
        </li>
        <li>
          Αν κάποιο προϊόν δεν είναι διαθέσιμο θα σας ενημερώσουμε με email ή
          τηλεφωνικώς για την πορεία της παραγγελίας σας.
        </li>
        <li>Παραδόσεις το Σάββατο δε γίνονται.</li>
        <li>
          Οι χρόνοι προετοιμασίας & παράδοσης ενδέχεται να επιμηκυνθούν σε
          περιόδους με μεγάλο όγκο παραγγελιών ή σε αργίες.
        </li>
      </ul>

      <h2>Αποστολές σε Κύπρο</h2>
      <p>
        Οι αποστολές των παραγγελιών πραγματοποιούνται αποκλειστικά μέσω της ACS
        Courier. Ο αγοραστής επιβαρύνεται με 8€ μεταφορικά έξοδα έως 1 κιλό, 9€
        έως 2 κιλά. Για επιπλέον κιλά επικοινωνήστε στο{" "}
        <a href="mailto:info@castine.gr">info@castine.gr</a>. Κατά την
        καταχώρηση της παραγγελίας σας, εισάγετε τη διεύθυνση στην οποία
        επιθυμείτε να αποσταλεί η παραγγελία. Μόλις ολοκληρώσετε την παραγγελία,
        σας αποστέλλεται αυτόματα email με την ανάλυση της παραγγελίας.
      </p>
      <p>
        <strong>Σημείωση:</strong> Όλες οι αποστολές σε Κύπρο γίνονται
        αποκλειστικά με online payment και οι ημέρες παράδοσης είναι 5-7
        εργάσιμες.
      </p>
    </div>
  );
};

export default ShippingInfo;
