import React from "react";

const Terms = () => {
  return (
    <div style={{ padding: "20px", fontFamily: "Arial, sans-serif" }}>
      <h1>ΟΡΟΙ ΧΡΗΣΗΣ</h1>
      <p>
        Καλώς ήρθατε στον δικτυακό τόπο της CASTINE. Χρησιμοποιώντας την
        ιστοσελίδα μας συμφωνείτε να τηρήσετε τους παρακάτω όρους χρήσης που σε
        συνδυασμό με την πολιτική μας σχετικά με την προστασία προσωπικών
        δεδομένων διέπουν τις σχέσεις συνεργασίας της CASTINE O.E μαζί σας όσον
        αφορά αυτόν τον δικτυακό τόπο.
      </p>
      <p>
        Ο όρος CASTINE αναφέρεται στην ιδιοκτήτρια εταιρεία αυτού του δικτυακού
        τόπου, CASTINE O.E. με έδρα Φρύνης 55 Αθήνα, (ΑΦΜ 802146742- ΔΟΥ ΙΖ
        Αθηνών ) , τηλ. 698 9417765 και email: info@castine.gr .
      </p>
      <h2>
        Η χρήση αυτού του δικτυακού τόπου διέπεται από τους παρακάτω όρους
        χρήσης:
      </h2>
      <p>
        Το περιεχόμενο, η δομή και η εμφάνιση των όρων της CASTINE δίνεται για
        την δική σας πληροφόρηση και χρήση και μπορεί να τροποποιηθεί χωρίς
        προηγούμενη ειδοποίηση.
      </p>
      <p>
        Η CASTINE και οποιοδήποτε τρίτο πρόσωπο δεν μπορεί να εγγυηθεί για την
        ακρίβεια, την ορθότητα ή την πληρότητα των πληροφοριών που παρέχονται σε
        αυτόν τον δικτυακό τόπο. Αναγνωρίζετε πως αυτές οι πληροφορίες μπορεί να
        περιέχουν λάθη ή ανακρίβειες για τα οποία η CASTINE δεν αναλαμβάνει τις
        ευθύνες.
      </p>
      <p>
        Κάνοντας χρήση των πληροφοριών που παρέχονται σε αυτό τον δικτυακό τόπο
        είναι αποκλειστικά δική σας ευθύνη, για το οποίο η CASTINE δεν φέρουμε
        ευθύνη. Είναι δική σας ευθύνη να βεβαιωθείτε πως οποιαδήποτε προϊόντα,
        υπηρεσίες ή πληροφορίες που είναι διαθέσιμα στις ιστοσελίδες καλύπτουν
        τις απαιτήσεις σας.
      </p>
      <p>
        Αυτός ο δικτυακός τόπος εμπεριέχει υλικό το οποίο ανήκει στην CASTINE.
        Αυτό το υλικό εμπεριέχει, τον σχεδιασμό, την διάταξη, την εμφάνιση, τα
        γραφικά, και τα κείμενα των ιστοσελίδων. Απαγορεύεται αυστηρά η
        αναπαραγωγή με οποιονδήποτε τρόπο του παραπάνω υλικού για εμπορικούς
        σκοπούς.
      </p>
      <p>
        Αυτός ο δικτυακός τόπος εμπεριέχει εξωτερικούς συνδέσμους προς άλλες
        ιστοσελίδες. Αυτοί οι σύνδεσμοι παρέχονται για την διευκόλυνση σας και
        για να σας παρέχουν επιπλέον πληροφόρηση. Δεν φέρουμε καμία ευθύνη για
        το περιεχόμενο των ιστοσελίδων στις οποίες παρέχουμε τέτοιους
        συνδέσμους.
      </p>
      <p>
        Απαγορεύεται η δημιουργία συνδέσμων προς τον δικτυακό τόπο
        www.castine.gr χωρίς προηγούμενη έγκριση της CASTINE.
      </p>
      <p>
        Oι συγκεκριμένες εκπτώσεις και τιμολογιακές πολιτικές που αναφέρονται
        στα eshop μας αφορούν μόνο τελικούς καταναλωτές.
      </p>
      <h2>Πολιτική Προστασίας Προσωπικών Δεδομένων</h2>
      <h3>1. Γενικές Πληροφορίες</h3>
      <p>
        Μέσω της Ιστοσελίδας της η ΕΤΑΙΡΕΙΑ έχει τη δυνατότητα να συλλέξει τα
        προσωπικά δεδομένα που χρειάζεται από εσάς ώστε να δημιουργήσει έναν
        ατομικό λογαριασμό στην ιστοσελίδα της, μέσω του οποίου μπορείτε να
        πραγματοποιήσετε παραγγελίες και να λαμβάνετε ενημερώσεις μέσω e-mail.
        Τα προσωπικά στοιχεία που συλλέγει η ΕΤΑΙΡΕΙΑ, συλλέγονται,
        επεξεργάζονται, καταχωρούνται και αποθηκεύονται εμπιστευτικά, από τον
        Υπεύθυνο Επεξεργασίας Δεδομένων σύμφωνα με τις ισχύουσες διατάξεις περί
        προστασίας προσωπικών δεδομένων της Ελλάδος (N.2472/97 όπως ισχύει
        σήμερα) και τις διατάξεις του Ευρωπαϊκού Δικαίου (ΕΚ 2016/679). Τα
        προσωπικά δεδομένα που τυχόν θα συλλέγονται ουδέποτε γνωστοποιούνται σε
        τρίτους (με εξαίρεση όπου προβλέπεται από το Νόμο και τις Αρμόδιες Αρχές
        και όσα ορίζονται στην παράγραφο 4 του παρόντος), αλλά διαφυλάσσεται ο
        προσωπικός τους χαρακτήρας. Η ΕΤΑΙΡΕΙΑ διατηρεί αρχεία με τα στοιχεία
        αυτά αποκλειστικά για λόγους επικοινωνίας, στατιστικούς και βελτίωσης
        των παρεχόμενων υπηρεσιών, διαχείρισης πελατολογίου.
      </p>
      <h3>
        2. Δικαίωμα πρόσβασης, διόρθωσης, διαγραφής και αντιστροφής της
        διαδικασίας
      </h3>
      <p>
        Σε περίπτωση που έχετε δημιουργήσει Λογαριασμό στην ιστοσελίδα, έχετε τη
        δυνατότητα να αποκτήσετε πρόσβαση ή να διορθώσετε τις προσωπικές σας
        πληροφορίες, πραγματοποιώντας είσοδο στο Λογαριασμό σας με το e-mail και
        τον κωδικό πρόσβασης που έχετε ορίσει κατά τη δημιουργία του Λογαριασμού
        σας. Σε κάθε περίπτωση έχετε το δικαίωμα να αποκτήσετε πρόσβαση, να
        διορθώσετε ή να διαγράψετε τις προσωπικές σας πληροφορίες ανά πάσα
        στιγμή, καθώς και να αρνηθείτε την επεξεργασία των στοιχείων σας,
        <ul>
          <li>μέσω e-mail (info@castine.gr)</li>
        </ul>
        Σε περίπτωση που δεν επιθυμείτε να λαμβάνετε διαφημιστικά e-mail, έχετε
        το δικαίωμα να διαγραφείτε από τη λίστα παραληπτών:
        <ul>
          <li>
            χρησιμοποιώντας το σύνδεσμο που βρίσκεται στο κάτω μέρος των e-mail
            που αποστέλλονται από την εταιρεία.
          </li>
        </ul>
        Ανήλικοι έχουν πρόσβαση στην ιστοσελίδα μόνο με τη συγκατάθεση των
        νόμιμων παραστατών ή κηδεμόνων τους.
      </p>
      <h3>3. Διαχείριση των προσωπικών στοιχείων από την εταιρία μας</h3>
      <h4>3.1 Μέθοδοι συλλογής στοιχείων</h4>
      <p>
        Τη χρονική στιγμή της εγγραφής σας στην Ιστοσελίδα, συλλέγουμε τα
        προσωπικά σας στοιχεία, χρησιμοποιώντας την φόρμα που διατίθεται στην
        ενότητα «ο λογαριασμός μου». Η ΕΤΑΙΡΕΙΑ συλλέγει κατά αυτό τον τρόπο το
        όνομά, το επώνυμο, την διεύθυνση ηλεκτρονικού ταχυδρομείου σας, το φύλο,
        την ημερομηνία γέννησής σας. Επιπρόσθετα μπορεί να σας ζητηθεί να μας
        παρέχετε πρόσθετες πληροφορίες, όπως προτιμήσεις σχετικά με προϊόντα /
        υπηρεσίες. Κατά την τοποθέτηση μιας παραγγελίας, συλλέγουμε προσωπικά
        στοιχεία χρησιμοποιώντας τη φόρμα που διατίθεται στην ενότητα
        «Δημιουργία λογαριασμού πελάτη» όπως αυτό ορίζεται στους Γενικούς Όρους
        και Προϋποθέσεις. Στο πλαίσιο αυτό, συλλέγουμε επιπρόσθετα στα στοιχεία
        που συγκεντρώθηκαν κατά την εγγραφή σας: την διεύθυνση σας (παράδοσης
        και τιμολόγησης, εφόσον είναι διαφορετική), το τηλέφωνό σας (αριθμό
        σταθερού και κινητού τηλεφώνου) και πληροφορίες σχετικά με την
        επιλεγμένη μέθοδο πληρωμής (αριθμός πιστωτικής κάρτας, κάτοχος της
        πιστωτικής κάρτας). Τέλος, όταν ζητάτε να δείτε σελίδες στην Ιστοσελίδα,
        οι διακομιστές της ΕΤΑΙΡΕΙΑΣ, αναγνωρίζουν αυτόματα την διεύθυνση IP του
        υπολογιστή σας (η αριθμητική διαδικτυακή διεύθυνση που αποδίδεται σε
        κάθε υπολογιστή σε ένα δίκτυο. Η διεύθυνση IP έχει την παρακάτω μορφή:
        XXX.XXX.XXX.XXX). Τα δεδομένα που συλλέγουμε και είναι απαραίτητα για να
        μπορέσουμε να απαντήσουμε στις αναζητήσεις σας ή στην παραγγελία σας,
        είναι σημειωμένα με αστερίσκο στις φόρμες συλλογής δεδομένων. Σε
        περίπτωση που δεν συμπληρώσετε τα υποχρεωτικά στοιχεία δεν θα μπορέσουμε
        να ολοκληρώσουμε την συναλλαγή μας. Μπορούμε να λάβουμε τις προσωπικές
        σας πληροφορίες από διάφορες πηγές. Ενδέχεται να συλλέξουμε αυτές τις
        πληροφορίες όταν τις προσφέρετε στον Ιστότοπο μας, σε πλατφόρμες
        κοινωνικής δικτύωσής μας, ή σε κάποιες από τις εκδηλώσεις μας. Όταν
        επισκέπτεστε αυτή τη Σελίδα, συλλέγουμε επίσης ορισμένες πληροφορίες με
        αυτοματοποιημένα μέσα, χρησιμοποιώντας τεχνολογίες, όπως cookies, web
        server logs και web beacons.
      </p>
      <h4>3.2 Στόχοι</h4>
      <p>
        Τα προσωπικά στοιχεία που συλλέγουμε από εσάς κάθε φορά που επισκέπτεστε
        την Ιστοσελίδα ή τοποθετείτε μια παραγγελία είναι απαραίτητα για τη
        συνολική διαχείριση της παραγγελίας σας από την ΕΤΑΙΡΕΙΑ και τους
        παρόχους, προστηθέντες της. Σε αυτή τη διαχείριση συμπεριλαμβάνεται και
        η ανίχνευση διαδικτυακής απάτης και απάτης σχετικά με τα σύγχρονα μέσα
        πληρωμής, η πρόληψη και η διαχείριση των περιστατικών πληρωμής (μη
        πληρωμής) και η διατήρηση των δικαιωμάτων της ΕΤΑΙΡΕΙΑΣ σχετικά με την
        εμπορική της δραστηριότητα. Επιπρόσθετα, αυτά τα δεδομένα μπορεί να
        χρησιμοποιηθούν ώστε να σας ενημερώνουμε σχετικά με προϊόντα και
        υπηρεσίες που παρέχονται από την ΕΤΑΙΡΕΙΑ και τις προσφορές ή
        προωθητικές της ενέργειες. Επιπλέον, διατηρούμε το δικαίωμα να
        συλλέγουμε ελεύθερα και να δημοσιεύουμε γενικές στατιστικές πληροφορίες
        στο προφίλ επισκεπτών της Ιστοσελίδας μας, χωρίς να αναφέρουμε ειδικές
        πληροφορίες όπως το όνομα και τη διεύθυνση των επισκεπτών αυτών.
        Μπορούμε να συλλέξουμε τα στατιστικά στοιχεία που απαιτούνται ώστε να
        ερμηνεύσουμε την χρήση της Ιστοσελίδας μας από τους επισκέπτες
        (συχνότητα προβολής από διάφορες άλλες Ιστοσελίδες, στατιστικά πωλήσεων
        και προέλευση των επισκεπτών της Ιστοσελίδας μας, κοκ). Τα δεδομένα
        σχετικά με το προφίλ των επισκεπτών μας θα τηρούνται μόνο από την
        ΕΤΑΙΡΕΙΑ όπως ορίζει το ελληνικό δίκαιο. Τέλος, η ΕΤΑΙΡΕΙΑ μπορεί να σας
        στείλει μέσω ηλεκτρονικού ταχυδρομείου (email) εμπορικές προτάσεις
        σχετικά με προϊόντα ή υπηρεσίες, προωθητικές ή διαφημιστικές ενέργειες,
        εκτός κι αν δηλώσετε την άρνησή σας, στα ανωτέρω στοιχεία επικοινωνίας
        που αναφέρονται στην Παράγραφο 2.
      </p>
      <h4>3.3 Διαχείριση Δεδομένων</h4>
      <p>Τα δεδομένα κρατούνται για χρονικό διάστημα πέντε (5) ετών.</p>
      <h4>3.4 Παραλήπτες δεδομένων</h4>
      <p>
        Όλα τα προσωπικά δεδομένα προορίζονται για την χρήση τους από την
        ΕΤΑΙΡΕΙΑ. Με την εξαίρεση φωτογραφιών, τα προσωπικά στοιχεία που έχουν
        συλλεχθεί από την Ιστοσελίδα μπορεί περιστασιακά να ζητηθούν από τους
        εμπορικούς μας εταίρους, έτσι ώστε να διασφαλιστεί η αντιμετώπιση του
        παραπάνω αναφερόμενου σκοπού, καθώς και για τον εντοπισμό περιπτώσεων
        απάτης σχετικά με πληρωμές και τη διαχείριση Εμπορικών Ενεργειών που
        οργανώθηκαν από την ΕΤΑΙΡΕΙΑ ή τους εμπορικούς εταίρους της. H ΕΤΑΙΡΕΙΑ
        περιορίζει στο μέτρο του δυνατού, τους παραλήπτες, ώστε να εξασφαλιστεί
        η επαρκής προστασία, σύμφωνα με την εκάστοτε ισχύουσα ελληνική και
        ευρωπαϊκή νομοθεσία.
      </p>
      <h4>3.5 Ασφάλεια και εμπιστευτικότητα των προσωπικών δεδομένων</h4>
      <p>
        Η ΕΤΑΙΡΕΙΑ έχει καταβάλει σημαντικές προσπάθειες ώστε να λάβει όλα τα
        προληπτικά μέτρα για να διατηρήσει την εμπιστευτικότητα και την ασφάλεια
        των δεδομένων προσωπικού χαρακτήρα και να αποτρέψει τη διαστρέβλωση, τη
        βλάβη, την καταστροφή τους, αλλά και την προσβασιμότητα τους από μη
        εξουσιοδοτημένα τρίτα μέρη. Τα τεχνικά και οργανωτικά μέτρα ασφαλείας
        περιλαμβάνουν τεχνολογία αιχμής. Παρόλα αυτά η εταιρεία δεν μπορεί να
        ελέγξει το ρίσκο που σχετίζεται με την λειτουργία του Διαδικτύου και ως
        εκ τούτου σας εφιστά την προσοχή στην ύπαρξη δυνητικών κινδύνων σχετικά
        με την χρήση και λειτουργία του.
      </p>
      <h4>3.6 Χρήση προσωπικών δεδομένων</h4>
      <p>
        Η ΕΤΑΙΡΕΙΑ δεν πρόκειται να μεταβιβάσει ή να διαθέσει με οποιοδήποτε
        τρόπο τα προσωπικά σας δεδομένα και τις πληροφορίες σας σε θυγατρικές,
        σε τρίτους και σε εμπορικούς ή επιχειρηματικούς συνεργάτες της χωρίς την
        πρότερη σχετική ενημέρωση σας. Σε περίπτωση που η ΕΤΑΙΡΕΙΑ αναγκαστεί
        από τον νόμο ή από δικαστική απόφαση να επικοινωνήσει τα προσωπικά
        δεδομένα των επισκεπτών της, θα ειδοποιήσει τον επισκέπτη της σχετικά,
        εφόσον αυτό είναι δυνατόν (εκτός από την περίπτωση που η ΕΤΑΙΡΕΙΑ εκτιμά
        πως δεν είναι υποχρεωμένη να το κάνει). Λαμβάνοντας υπόψιν το επίπεδο
        της τεχνολογίας που σχετίζεται με τον τομέα της τηλεπικοινωνίας, η
        ΕΤΑΙΡΕΙΑ δε μπορεί να διασφαλίσει την εμπιστευτικότητα, και την
        ακεραιότητα της εξακρίβωσης της αυθεντικότητας των email που ο
        επισκέπτης στέλνει ή λαμβάνει από την ΕΤΑΙΡΕΙΑ. Διατηρούμε τα στοιχεία
        σας για περιορισμένη διάρκεια πέντε χρόνων, αρχίζοντας από τον χρόνο της
        τελευταίας αλληλεπίδρασής σας μαζί μας, εκτός εάν υφίσταται υποχρέωση
        για τη διατήρηση των πληροφοριών για μακρύτερο χρονικό διάστημα από τον
        νόμο, ή εάν αυτό απαιτείται στο πλαίσιο κάποιας δικαστικής διαδικασίας.
        Ενδέχεται να χρησιμοποιήσουμε τις πληροφορίες που μας παρέχετε
        προκειμένου να:
        <ul>
          <li>
            Σας αποστείλουμε διαφημιστικό υλικό ή άλλες διαφημιστικές
            επικοινωνίες, με την προηγούμενη συγκατάθεσή σας
          </li>
          <li>Σας παρέχουμε υπηρεσίες</li>
          <li>Επεξεργαστούμε πληρωμές σας και/ή συναλλαγές με κάρτα δώρου</li>
          <li>Δημιουργήσουμε και διαχειριστούμε τον online λογαριασμό σας</li>
          <li>Απαντήσουμε σε αιτήματά σας</li>
          <li>
            Επικοινωνήσουμε μαζί σας σχετικά με, και να σας παρέχουμε συμμετοχή
            σε, ειδικές εκδηλώσεις, διαγωνισμούς, κληρώσεις, προγράμματα,
            έρευνες και λοιπές προσφορές
          </li>
          <li>
            Λειτουργούμε, αξιολογούμε και βελτιώνουμε την επαγγελματική μας
            δραστηριότητα (συμπεριλαμβανομένης της ανάπτυξης νέων προϊόντων και
            υπηρεσιών, της ενίσχυσης και βελτίωσης των υπηρεσιών μας, της
            διαχείρισης της επικοινωνίας μας, της ανάλυσης των προϊόντων μας,
            της διεξαγωγής data analytics, και της εκτέλεσης των λογιστικών,
            ελεγκτικών και άλλων εσωτερικών λειτουργιών μας)
          </li>
          <li>
            Συνάδουμε με τις ισχύουσες νομικές απαιτήσεις, τα σχετικά
            βιομηχανικά πρότυπα και τις πολιτικές μας
          </li>
        </ul>
        Ενδέχεται επίσης να χρησιμοποιήσουμε τις πληροφορίες με άλλους τρόπους,
        για τους οποίους θα παρέχουμε συγκεκριμένη ειδοποίηση κατά τη στιγμή της
        συλλογής τους.
      </p>
      <h4>3.7 Πληροφορίες που συλλέγουμε με αυτοματοποιημένα μέσα</h4>
      <p>
        Όταν επισκέπτεστε αυτή τη σελίδα, συλλέγουμε συγκεκριμένες πληροφορίες
        με αυτοματοποιημένα μέσα, χρησιμοποιώντας τεχνολογίες όπως cookies, web
        server logs και web beacons. Ενδέχεται να χρησιμοποιήσουμε υπηρεσίες web
        analytics τρίτων στην παρούσα σελίδα, τις σελίδες κοινωνικής δικτύωσής
        μας, ή τις εφαρμογές μας για κινητά. Οι πάροχοι υπηρεσιών που
        διαχειρίζονται τις υπηρεσίες αυτές χρησιμοποιούν τεχνολογίες, όπως
        cookies, web server logs και web beacons για να μας βοηθήσουν να
        αναλύσουμε το πώς οι επισκέπτες χρησιμοποιούν τη σελίδα. Οι πληροφορίες
        που συλλέγονται μέσω αυτών των μέσων (συμπεριλαμβανομένης της διεύθυνσης
        IP) γνωστοποιούνται σε αυτούς τους παρόχους υπηρεσιών, οι οποίοι
        χρησιμοποιούν τις πληροφορίες για να αξιολογήσουν τη χρήση της
        ιστοσελίδας.
      </p>
      <h4>3.8 Στοχευμένη διαφήμιση</h4>
      <p>
        Ενδέχεται επίσης να αναθέσουμε τις διαφημίσεις μας σε διαφημιστικά
        δίκτυα τρίτων που συλλέγουν διευθύνσεις IP και άλλες πληροφορίες, μέσω
        της χρήσης cookies, web server logs και web beacons στους ιστοχώρους
        μας, σε ηλεκτρονικά ταχυδρομεία και σε διαδικτυακούς τόπους τρίτων.
        Αυτές τις πληροφορίες τις χρησιμοποιούν προκειμένου να προβάλουν
        διαφημίσεις για προϊόντα και υπηρεσίες προσαρμοσμένες στα ενδιαφέροντά
        σας (συμπεριλαμβανομένων εταιρειών που δεν ελέγχονται από εμάς).
        Μπορείτε να δείτε αυτές τις διαφημίσεις στις ιστοσελίδες μας και σε
        άλλες ιστοσελίδες. Αυτή η διαδικασία μας βοηθά επίσης να διαχειριζόμαστε
        και να παρακολουθούμε την αποτελεσματικότητα των διαφημιστικών ενεργειών
        μας.
      </p>
      <h4>
        3.9 Πώς χρησιμοποιούμε τις πληροφορίες που συλλέγουμε με
        αυτοματοποιημένα μέσα
      </h4>
      <p>
        Ενδέχεται να χρησιμοποιήσουμε τις πληροφορίες που συλλέγονται μέσω
        αυτοματοποιημένων μέσων στην παρούσα σελίδα για να μεταδώσουμε
        εξατομικευμένο περιεχόμενο, για έρευνα αγοράς, ανάλυση δεδομένων και
        σκοπούς διαχείρισης συστημάτων, έτσι ώστε να διαπιστωθεί αν μας έχετε
        επισκεφτεί στο παρελθόν ή αν είστε νέοι επισκέπτες στη σελίδα, καθώς και
        για τη συμμόρφωση με νομικές υποχρεώσεις, πολιτικές και διαδικασίες μας,
        συμπεριλαμβανομένης της συμμόρφωσης με τα σχετικά βιομηχανικά πρότυπα
        και την επιβολή των Όρων και Προϋποθέσεων μας. Μπορούμε επίσης να
        χρησιμοποιήσουμε τις πληροφορίες με άλλους τρόπους, για τους οποίους θα
        παρέχεται ειδική ειδοποίηση κατά τη στιγμή της συλλογής.
      </p>
      <h3>4. Πληροφορίες που μοιραζόμαστε</h3>
      <p>
        Δεν πουλάμε και δεν αποκαλύπτουμε προσωπικές πληροφορίες που συλλέγουμε
        σχετικά με εσάς, εκτός από τις περιπτώσεις που περιγράφονται εδώ.
        Ενδέχεται να μοιραστούμε τις προσωπικές σας πληροφορίες με:
        <ul>
          <li>
            Τους συνεργάτες μας για τους σκοπούς που περιγράφονται στην Πολιτική
            Προστασίας Προσωπικών Δεδομένων της ΕΤΑΙΡΙΑΣ.
          </li>
          <li>
            Παρόχους υπηρεσιών που παρέχουν υπηρεσίες για λογαριασμό μας βάσει
            των οδηγιών μας. Δεν εξουσιοδοτούμε αυτούς τους παρόχους να
            χρησιμοποιήσουν ή να αποκαλύψουν τις πληροφορίες εκτός εάν είναι
            απαραίτητο για την παροχή υπηρεσιών για λογαριασμό μας ή για
            συμμόρφωση με νομικές απαιτήσεις. Παραδείγματα αυτών των παρόχων
            υπηρεσιών περιλαμβάνουν τις οντότητες που επεξεργάζονται πληρωμές με
            πιστωτική κάρτα, την επεξεργασία των παραγγελιών, καθώς και την
            παροχή υπηρεσιών φιλοξενίας δικτύου και διαφήμισης.
          </li>
          <li>Λοιπά τρίτα μέρη με τη συναίνεσή σας.</li>
        </ul>
        Επιπρόσθετα, ενδέχεται να αποκαλύψουμε πληροφορίες σχετικά με εσάς (i)
        αν είμαστε υποχρεωμένοι να ενεργήσουμε έτσι από το νόμο ή νομική
        διαδικασία, (ii) στις αρχές επιβολής του νόμου ή άλλους κυβερνητικούς
        αξιωματούχους, ή (iii) όταν πιστεύουμε ότι η αποκάλυψη είναι αναγκαία ή
        κατάλληλη να αποτρέψει σωματική βλάβη ή οικονομική απώλεια, ή σε
        συνεργασία με έρευνα ύποπτης ή πρακτική δόλιας ή παράνομης
        δραστηριότητας. Διατηρούμε επίσης το δικαίωμα να μεταφέρουμε τις
        προσωπικές πληροφορίες που έχουμε για εσάς σε περίπτωση πώλησης ή
        μεταβίβασης του συνόλου ή ενός τμήματος της επιχείρησης ή των
        περιουσιακών στοιχείων μας. Σε περίπτωση που συμβεί μια τέτοια πώληση ή
        μεταβίβαση, θα χρησιμοποιήσουμε εύλογες προσπάθειες για να κατευθύνουμε
        τον εκδοχέα να χρησιμοποιήσει τις προσωπικές πληροφορίες που έχετε
        παράσχει σε μας με τρόπο που είναι συνεπής με την Πολιτική Προστασίας
        Προσωπικών Δεδομένων μας. Μετά από μια τέτοια πώληση ή μεταβίβαση,
        μπορείτε να επικοινωνήσετε με την οντότητα στην οποία θα μεταφερθούν τα
        προσωπικά σας στοιχεία με οποιεσδήποτε απορίες σχετικά με την
        επεξεργασία των εν λόγω πληροφοριών.
      </p>
      <h3>5. Τα δικαιώματα και οι επιλογές σας</h3>
      <p>
        Σας προσφέρουμε συγκεκριμένες επιλογές σε σχέση με τις προσωπικές
        πληροφορίες που συλλέγουμε από εσάς, όπως σε σχέση με το πώς
        χρησιμοποιούμε τις πληροφορίες και τον τρόπο που επικοινωνούμε μαζί σας.
        Για να επικαιροποιήσετε τις προτιμήσεις σας, να μας ζητήσετε να
        αφαιρέσουμε τις πληροφορίες σας από τις λίστες αλληλογραφίας μας ή
        υποβάλετε ένα αίτημα, παρακαλούμε επικοινωνήστε μαζί μας όπως ορίζεται
        κατωτέρω.
      </p>
      <h4>
        5.1 Μη συμμετοχή σε μηνύματα ηλεκτρονικού ταχυδρομείου (Email Opt-Out)
      </h4>
      <p>
        Μπορείτε ανά πάσα στιγμή να μας πείτε να μην σας αποστέλλουμε
        διαφημιστική επικοινωνία μέσω ηλεκτρονικού ταχυδρομείου, κάνοντας κλικ
        στο σύνδεσμο διαγραφής που θα βρείτε εντός των διαφημιστικών μηνυμάτων
        ηλεκτρονικού ταχυδρομείου που λαμβάνετε από εμάς ή επικοινωνώντας μαζί
        μας ως αναφέρεται παρακάτω. Μπορείτε επίσης να εξαιρεθείτε από τη λήψη
        διαφημιστικών μηνυμάτων ηλεκτρονικού ταχυδρομείου της ΕΤΑΙΡΕΙΑΣ
        στέλνοντας μας e-mail στο info@castine.gr.
      </p>
      <h4>5.2 Μη συμμετοχή σε μηνύματα μέσω ταχυδρομείου</h4>
      <p>
        Μπορείτε να ζητήσετε από την ΕΤΑΙΡΕΙΑ να σταματήσει να σας στέλνει
        διαφημιστικά μηνύματα μέσω ταχυδρομείου ακολουθώντας τις οδηγίες που
        ενδεχομένως συμπεριλαμβάνονται σε μια συγκεκριμένη προωθητική ενέργεια.
        Μπορείτε επίσης να ζητήσετε να μην μας επιτρέπεται να σας στέλνουμε
        διαφημιστικό υλικό ταχυδρομικά επικοινωνώντας μαζί μας όπως αναφέρεται
        παρακάτω.
      </p>
      <h4>5.3 Απόσυρση Συγκατάθεσης</h4>
      <p>
        Μπορείτε να αποσύρετε οποιαδήποτε συγκατάθεση μας έχετε παράσχει ή να
        προβάλετε ένσταση σε οποιαδήποτε στιγμή για νόμιμους λόγους, ως προς την
        επεξεργασία των προσωπικών σας πληροφοριών. Θα εφαρμόσουμε τις
        προτιμήσεις σας μέσα σε εύλογο χρονικό διάστημα. Σε ορισμένες
        περιπτώσεις, αποσύροντας τη συγκατάθεσή σας για τη χρήση ή αποκάλυψη των
        προσωπικών σας πληροφοριών μας, ενδέχεται να σημαίνει ότι δε θα μπορείτε
        να εκμεταλλευτείτε κάποια από τα προϊόντα ή τις υπηρεσίες μας.
      </p>
      <h4>
        5.4 Επανεξέταση, επικαιροποίηση και τροποποίηση Προσωπικών Δεδομένων
      </h4>
      <p>
        Με την επιφύλαξη της ισχύουσας νομοθεσίας, μπορεί να έχετε το δικαίωμα
        να ζητήσετε πρόσβαση και να λάβετε λεπτομέρειες σχετικά με τις
        προσωπικές πληροφορίες που διατηρούμε για εσάς, να ενημερώσετε και να
        διορθώσετε ανακρίβειες στα προσωπικά σας δεδομένα, και να ζητήσετε το
        μπλοκάρισμα ή τη διαγραφή τους, ανάλογα με την περίπτωση. Το δικαίωμα
        πρόσβασης σε προσωπικές πληροφορίες μπορεί να περιορίζεται σε ορισμένες
        περιπτώσεις από τις απαιτήσεις της τοπικής νομοθεσίας. Μπορείτε να
        ζητήσετε να αναθεωρήσετε, να αλλάξετε ή να διαγράψετε τα προσωπικά σας
        στοιχεία στέλνοντας ένα email στο info@castine.gr.
      </p>
      <h3>6. Μεταφορές δεδομένων</h3>
      <p>
        Μπορούμε να μεταβιβάσουμε τις προσωπικές πληροφορίες που συλλέγουμε
        σχετικά με εσάς σε άλλες χώρες εκτός της χώρας στην οποία οι πληροφορίες
        συλλέχθηκαν αρχικά. Οι χώρες αυτές ενδέχεται να μην έχουν τους ίδιους
        νόμους προστασίας δεδομένων με τη χώρα στην οποία παρείχατε αρχικά τις
        πληροφορίες.
      </p>
      <h3>7. Πώς προστατεύουμε τα προσωπικά δεδομένα</h3>
      <p>
        Διατηρούμε κατάλληλες διοικητικές, τεχνικές και φυσικές δικλείδες που
        σχεδιάστηκαν για την προστασία των προσωπικών στοιχείων που παρέχετε από
        τυχαία, παράνομη ή μη εγκεκριμένη καταστροφή, απώλεια, αλλοίωση,
        πρόσβαση, αποκάλυψη ή χρήση.
      </p>
      <h3>8. Πώς να επικοινωνήσετε μαζί μας</h3>
      <p>
        Εάν έχετε οποιεσδήποτε ερωτήσεις ή σχόλια σχετικά με την παρούσα ή αν θα
        επιθυμούσατε να επικαιροποιήσετε τις πληροφορίες που έχουμε για εσάς ή
        τις προτιμήσεις σας, παρακαλούμε επικοινωνήσετε με τον Υπεύθυνο
        Επεξεργασίας Δεδομένων μας στα στοιχεία που αναγράφονται στην αρχή της
        παρούσας.
      </p>
      <h3>ΕΠΙΚΟΙΝΩΝΙΑ ΜΑΖΙ ΜΑΣ</h3>
      <p>
        Μπορείτε να επικοινωνήσετε ανά πάσα στιγμή με την CASTINE στέλνοντας
        email στο info@castine.gr.
      </p>
    </div>
  );
};

export default Terms;
